app/controllers/artists_controller.rb

SELECT "artists".* FROM "artists"
SELECT "songs".* FROM "songs"
---
  def index
    @artists = Artist.all
    @songs = Song.all